# Задачата ви е да изчислите колко е броят на котките във всяка група и
# парите, които са нужни на собственика за храната им за един ден, ако 1 кг храна = 12.45 лева.
#     • Ако котката изяжда от 100 (вкл.)  до 200 грама, то тя попада в група 1: малки котки.
#     • Ако котката изяжда от 200 (вкл.)  до 300 грама, то тя попада в група 2: големи котки.
#     • Ако котката изяжда от 300 (вкл.)  до 400 грама, то тя попада в група 3: огромни котки.
# Вход:
#     • На първи ред - броят на котките - цяло число в интервала [1..100]
#     • На всеки следващ ред за всяка котка - Х грама храна - реално число в интервала [100.00..400.00]
# Изход:
# Отпечатват се следните редове:
# “Group 1: {броят на котките в група 1: малки котки} cats.”
# “Group 2: {броят на котките в група 2: големи котки} cats.”
# “Group 3: {броят на котките в група 3: огромни котки} cats.”
# “Price for food per day: {цената за храната} lv.”
# Цената на храната трябва да бъде закръглена до втория знак след десетичната запетая.
number_of_cats = int(input())
group1 = 0
group2 = 0
group3 = 0
food_per_day = 0
price_food_per_day = 0
for cats in range(number_of_cats):
    grams_food = float(input())
    if 100 <= grams_food < 200:
        group1 += 1
    elif 200 <= grams_food < 300:
        group2 += 1
    elif 300 <= grams_food < 400:
        group3 += 1
    food_per_day += grams_food
price_food_per_day = food_per_day * 12.45 / 1000
print(f'Group 1: {group1} cats.')
print(f'Group 2: {group2} cats.')
print(f'Group 3: {group3} cats.')
print(f'Price for food per day: {price_food_per_day:.2f} lv.')
